# Terraform plan for staging
  
  ```
  Plan: 1 to add, 0 to change, 1 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  local_file.default: Refreshing state... [id=d9a3b1f10addc7d8b809264d44dc65ba3898f34f]
random_id.terraform_remote_backend: Refreshing state... [id=IJz2BT6JidA]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=209cf6053e8989d0-terraform-remote-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # local_file.backend will be created
  + resource "local_file" "backend" {
      + content              = <<-EOT
            terraform {
              backend "gcs" {
                bucket = "209cf6053e8989d0-terraform-remote-backend"
              }
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "./backend.tf"
      + id                   = (known after apply)
    }

  # local_file.default will be destroyed
  # (because local_file.default is not in configuration)
  - resource "local_file" "default" {
      - content              = <<-EOT
            terraform {
              backend "gcs" {
                bucket = "209cf6053e8989d0-terraform-remote-backend"
              }
            }
        EOT -> null
      - content_base64sha256 = "ccCMDsK7633xVKCxbcS3Y7gwXDA+fnkMJawkrmbWdTA=" -> null
      - content_base64sha512 = "Wb1AoKNGU+zk4bJD8I/9JBuy3I91gDvYX8qAvZwc7hu68vOrRWrcJmaTF2cLoxv2KAv673LwiCx2nGw6aZWilA==" -> null
      - content_md5          = "e1b1980867b3c9aa8f16509b1efeee92" -> null
      - content_sha1         = "d9a3b1f10addc7d8b809264d44dc65ba3898f34f" -> null
      - content_sha256       = "71c08c0ec2bbeb7df154a0b16dc4b763b8305c303e7e790c25ac24ae66d67530" -> null
      - content_sha512       = "59bd40a0a34653ece4e1b243f08ffd241bb2dc8f75803bd85fca80bd9c1cee1bbaf2f3ab456adc26669317670ba31bf6280bfaef72f0882c769c6c3a6995a294" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0644" -> null
      - filename             = "./backend.tf" -> null
      - id                   = "d9a3b1f10addc7d8b809264d44dc65ba3898f34f" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
